#include <iostream>
using namespace std;
int main(){
    int dayWeek;
    cout << "----------Бизнес-ланч----------\n";
    cout << "Введите день недели (от 1 до 7): ";
    cin >> dayWeek;
    if (dayWeek == 1){
        cout << "Меню сегодня (понедельник):\n";
        cout << "Гороховый суп\n";
        cout << "Салат «Цезарь» с креветками\n";
        cout << "Куриная ножка с пюре\n";
    } else if (dayWeek == 2){
        cout << "Меню сегодня (вторник):\n";
        cout << "Харчо\n";
        cout << "Салат «Оливье»\n";
        cout << "Баварские колбаски с капустой\n";
    } else if (dayWeek == 3){
        cout << "Меню сегодня (среда):\n";
        cout << "Борщ\n";
        cout << "Салат «От Шефа»\n";
        cout << "Макароны по флотски\n";
    } else if (dayWeek == 4){
        cout << "Меню сегодня (четверг):\n";
        cout << "Уха\n";
        cout << "Салат «Витаминка»\n";
        cout << "Рис с рыбой в кляре\n";
    } else if (dayWeek == 5){
        cout << "Меню сегодня (пятница):\n";
        cout << "Суп куриный\n";
        cout << "Салат «Овощной»\n";
        cout << "Второе с мясом\n";
    } else if (dayWeek == 6){
        cout << "Меню сегодня (суббота):\n";
        cout << "Солянка сборная мясная\n";
        cout << "Салат «Мимоза»\n";
        cout << "Лазанья\n";
    } else if (dayWeek == 7){
        cout << "Меню сегодня (воскресение):\n";
        cout << "Суп кулеш из пшена\n";
        cout << "Салат «Столичный» с курицей\n";
        cout << "Куриное филе с лисичками в сливочном соусе\n";
    } 
    cout << "Морс\n";
}