#include <iostream>

using namespace std;
int main(){
    float x, y;

    cout << "======Компьютерное зрение======\n";
    while (true){
        cout << "=============================\n";
        cout << "Введите местоположение фигуры: "; cin >> x >> y;

        while (x <= 0 || y <= 0 || x >= 1 || y >= 1) {
            cout << "Ошибка! Введите местоположение фигуры в процентах: "; cin >> x >> y;
        }

        x *= 10;
        y *= 10;

        cout << "Фигура находится в клетке (" << (int) x <<", " << (int) y << ").\n";
    }

}