#include <iostream>

using namespace std;
int main(){
    float x, y;

    cout << "======Компьютерное зрение======\n";
    while (true){
        cout << "=============================\n";
        cout << "Введите местоположение фигуры: "; cin >> x >> y;

        while (x <= 0 || y <= 0 || x >= 1 || y >= 1) {
            cout << "Ошибка! Введите местоположение фигуры в процентах: "; cin >> x >> y;
        }

        x *= 1000;
        y *= 1000;
        
        cout << "Фигура находится в клетке (" << (int) (x*0.01) <<", " << (int) (y*0.01) << ").\n";
        if ((int) x % 50 != 0 || (int) y % 50 != 0) cout << "Поправьте положение фигуры на (" << (50 - (int) x % 100) * 0.001 <<", " << (50 - (int) y % 100) * 0.001 << ").\n";
    }
}